In [12]:
import numpy as np
import pandas as pd

In [13]:
sozluk1 ={"İsim" : ["Ahmet","Mehmet","Zeynep","Atil"]," Spor" : ["Koşu","Yüzme","Koşu","Basketbol"], "Kalori" : [100,200,300,400] }

In [14]:
dataFrame1 = pd.DataFrame(sozluk1, index =[0,1,2,3])

In [15]:
dataFrame1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atil  Basketbol     400

In [16]:
sozluk2 ={"İsim" : ["Osman","Levent","Atlas","Fatma"]," Spor" : ["Koşu","Yüzme","Koşu","Basketbol"], "Kalori" : [200,400,300,400] }

In [17]:
dataFrame2 = pd.DataFrame(sozluk2, index =[4,5,6,7])

In [18]:
sozluk3 ={"İsim" : ["Aysel","Mahmut","Duygu","Nur"]," Spor" : ["Koşu","Yüzme","Badminton","Tenis"], "Kalori" : [300,400,500,400] }

In [19]:
dataFrame3 = pd.DataFrame(sozluk3, index =[8,9,10,11])

In [20]:
dataFrame2

     İsim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     400
6   Atlas       Koşu     300
7   Fatma  Basketbol     400

In [21]:
dataFrame3

      İsim       Spor  Kalori
8    Aysel       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     400

In [24]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis =0)

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atil  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     400
6    Atlas       Koşu     300
7    Fatma  Basketbol     400
8    Aysel       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     400

## merging

In [25]:
mergeSozluk1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atil"]," Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [26]:
mergeDataFrame1= pd.DataFrame(mergeSozluk1)

In [27]:
mergeDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atil  Basketbol

In [28]:
mergesozluk2 ={"İsim" : ["Ahmet","Mehmet","Zeynep","Atil"], "Kalori" : [100,200,300,400] }

In [29]:
mergeDataFrame2= pd.DataFrame(mergesozluk2)

In [30]:
mergeDataFrame2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atil     400

In [31]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on ="İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atil  Basketbol     400

In [32]:
maasSozluk = {"Isim" : ["Atil","Zeynep","Mehmet","Ahmet"],"Departman":["Yazılım","Satış","Pazarlama","Yazılım"],"Maas" : [200,300,400,500]}

In [33]:
maasDataFrame= pd.DataFrame(maasSozluk)

In [34]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [35]:
maasDataFrame["Departman"].unique()
## Departman sütunundaki birden fazla sahip olmayanları getirir.

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [36]:
maasDataFrame["Departman"].nunique()
## Number of unique

3

In [38]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [42]:
def bruttenNete (maas) :
    return  maas * 0.66

In [43]:
maasDataFrame["Maas"].apply(bruttenNete)
## metotları uygular

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [44]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [54]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer", "Bart", "Bart"],
              "Karakter Yas" : [9,10,50,20,10]}

In [55]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [56]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [57]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [58]:
## Eğer aynı isimde biri varsa aynı grupta değerlerinin ortalamsını alır.

In [60]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc = np.sum)
## aggfunc ile numpy bartları aracılığıyla toplama yaptırdık.

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10